foam_dir/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

mkdir -p constant/triSurface

# Copy bullet surface from resources directory
cp -f $FOAM_TUTORIALS/resources/geometry/cavitating_hydrofoil_10aoa.stl.gz constant/triSurface/

# Generate the base block mesh
runApplication blockMesh

# Generate the snappy mesh
runApplication snappyHexMesh -overwrite

restore0Dir

# Initialise with potentialFoam solution
runApplication potentialFoam -pName p_rgh -writephi

# Run the solver
runApplication $(getApplication)

#------------------------------------------------------------------------------
